using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class QuestionsDataStore : MonoBehaviour
{
    public List<string> QuestionsData = new List<string>()
    {
        "რომელ ენერგიის წყაროს აქვს ნაკლები ზიანი გარემოსთვის?|ბირთვული ენერგია|ქვანახშირი|ქარის ენერგია|გაზის ენერგია|ქარის ენერგია",
        "რა არის მდგრადი განვითარების მიზანი?|ეკონომიკის განვითარება ბუნებრივი რესურსების დაზიანებით|ბუნებრივი რესურსების ეფექტურად გამოყენება და მათი განახლება|მხოლოდ ტურიზმის ხელშეწყობა|მხოლოდ ურბანული განვითარების ხელშეწყობა|ბუნებრივი რესურსების ეფექტურად გამოყენება და მათი განახლება",
        "რა არის ნარჩენების მართვის საუკეთესო პრაქტიკა?|ყველა ნარჩენის ერთად ჩაყრა|ნარჩენების გადამუშავება და კომპოსტირება|ნარჩენების დაწვა ღია სივრცეში|ნარჩენების ჩაყრა მდინარეებში|ნარჩენების გადამუშავება და კომპოსტირება",
        "როგორ ეხმარება ველოსიპედის გამოყენება გარემოს?|გაზრდის ტრანსპორტის გამონაბოლქვს|ამცირებს ტრანსპორტის გამონაბოლქვს|ზრდის ხმაურის დაბინძურებას|ამცირებს ჰაერის ხარისხს|ამცირებს ტრანსპორტის გამონაბოლქვს",
        "როგორ შეიძლება მოქალაქემ ხელი შეუწყოს გარემოს დაცვას?|ხეების გაჩეხვით|რეციკლირებად პროდუქტებზე გადასვლით|მხოლოდ საწვავის გამოყენების გაზრდით|ნაგვის ნარჩენების დატოვებით ქუჩებში|რეციკლირებად პროდუქტებზე გადასვლით",
        "როგორ ეხმარება საზოგადოებრივი ტრანსპორტის გამოყენება გარემოს?|ამცირებს მანქანების რაოდენობას გზებზე|ზრდის მანქანების რაოდენობას გზებზე|ამცირებს ტრანსპორტის ხელმისაწვდომობას|ზრდის ხმაურის დაბინძურებას|ამცირებს მანქანების რაოდენობას გზებზე",
        "რა არის მოქალაქის ძირითადი უფლება ადგილობრივ თვითმმართველობაში?|პრობლემების უგულებელყოფა|საჯარო განხილვებში მონაწილეობა|საჯარო სივრცეების დაბინძურება|დესტრუქციული ქმედებები|საჯარო განხილვებში მონაწილეობა",
        "რა არის კლიმატის ცვლილების ძირითადი მიზეზი?|ტრანსპორტის გამონაბოლქვი და საწვავის მოხმარება|ხეების დარგვა|ნარჩენების გადამუშავება|გარემოს დაცვითი ღონისძიებები|ტრანსპორტის გამონაბოლქვი და საწვავის მოხმარება",
        "რა არის ნარჩენების მინიმალიზაციის მეთოდი?|მხოლოდ ერთჯერადი პლასტმასის გამოყენება|პროდუქტების მეორედ გამოყენება და გადამუშავება|ნარჩენების ჩაყრა ბუნებაში|ნარჩენების წვა|პროდუქტების მეორედ გამოყენება და გადამუშავება",
        "რომელი ქმედება ზრდის ბიომრავალფეროვნებას?|ტყის გაჩეხვა|ახალი მცენარეების დარგვა|მონოკულტურების გაშენება|შხამქიმიკატების გამოყენება|ახალი მცენარეების დარგვა",
        "როგორ შეიძლება მოქალაქემ ხელი შეუწყოს ქალაქის სისუფთავეს?|ნაგვის ურნაში ჩაყრით|ნარჩენების ქუჩაში დაყრით|ხეების ფესვების დაზიანებით|დაბინძურებული წყლების გადმოტრიალებით|ნაგვის ურნაში ჩაყრით",
        "რა არის მდგრადი ტრანსპორტის მაგალითი?|ელექტრო ტრანსპორტი|ბენზინის მანქანა|დიეზელის ტრაილერი|ტრადიციული ველოსიპედი|ელექტრო ტრანსპორტი",
        "როგორ შეიძლება წყლის რესურსების დაზოგვა?|წყლის გაჟონვის უგულებელყოფით|წყლის ჭკვიანური გამოყენებით|გაურკვეველი წყლების მოხმარებით|წყლის მუდმივი გადინებით|წყლის ჭკვიანური გამოყენებით",
        "რომელი ქმედება ამცირებს ტყის დეგრადაციას?|ტყის გაჩეხვა|ხეების გაშენება და დაცვა|ბუნებრივი კატასტროფების უგულებელყოფა|ინტენსიური ხის მასალის მოპოვება|ხეების გაშენება და დაცვა",
        "რა არის მოქალაქის ვალდებულება გარემოს დაცვის საკითხებში?|გარემოს დაბინძურება|ხე-მცენარეების დარგვა|ნარჩენების ქუჩაში დაყრა|პლასტმასის გამოყენების გაზრდა|ხე-მცენარეების დარგვა",
        "როგორ შეიძლება შემცირდეს ენერგიის მოხმარება?|დაბალი ენერგიის ტექნოლოგიების გამოყენებით|მუდმივად ჩართული ტექნიკის დატოვებით|მხოლოდ ძვირად ღირებული პროდუქტების გამოყენებით|ტექნიკის უყურადღებოდ მოხმარებით|დაბალი ენერგიის ტექნოლოგიების გამოყენებით",
        "რომელი ქმედება უწყობს ხელს წყლის დაბინძურებას?|ქიმიური ნივთიერებების მდინარეში ჩაყრა|წყლის სწორად გამოყენება|გადამუშავებული წყლის გამოყენება|მცენარეთა სარწყავი სისტემების გაუმჯობესება|ქიმიური ნივთიერებების მდინარეში ჩაყრა",
        "რა არის მდგრადი საცხოვრებელი ტერიტორიის მახასიათებელი?|ენერგიის ეფექტურად გამოყენება და გარემოს დაცვა|ძველი შენობების დემონტაჟი ყველა შემთხვევაში|შენობების ეკოლოგიური უგულებელყოფა|ხეების გაჩეხვა ურბანული განვითარების დროს|ენერგიის ეფექტურად გამოყენება და გარემოს დაცვა",
        "როგორ ეხმარება ეკოსისტემების დაცვა ბიომრავალფეროვნებას?|შხამქიმიკატების გამოყენებით|ბუნებრივი ჰაბიტატების დაცვით|ინტენსიური ფერმერობით|ბუნებრივი რესურსების უგულებელყოფით|ბუნებრივი ჰაბიტატების დაცვით",
        "რა არის საზოგადოების როლი ენერგიის ეკონომიაში?|მხოლოდ ელექტროენერგიის მოხმარების გაზრდა|სხვა რესურსების უგულებელყოფა|ენერგოეფექტური ტექნოლოგიების გამოყენება|მუდმივად ფანჯრების გახსნა ზამთარში|ენერგოეფექტური ტექნოლოგიების გამოყენება",
        "რა გავლენა შეიძლება ჰქონდეს მდგრადი ენერგიის გამოყენებას გლობალურ დათბობაზე?|ამცირებს სათბურის გაზების გამოყოფას და ანელებს დათბობას|აძლიერებს ნახშირორჟანგის გამოყოფას ატმოსფეროში|ხელს უწყობს ტემპერატურის სწრაფ ზრდას|არანაირ გავლენას არ ახდენს კლიმატზე|ამცირებს სათბურის გაზების გამოყოფას და ანელებს დათბობას"
    };

    public List<string> LocationsData = new List<string>()
    {
        "ბიჭვინთის ნაკრძალი",
        "კინტრიშის ნაკრძალი",
        "მიუსერის ნაკრძალი",
        "გუმისთის ნაკრძალი",
        "სათაფლიის ნაკრძალი",
        "სკურჩის ნაკრძალი"
    };

    public List<string> TreeNamesData = new List<string>()
    {
        "მუხა",
        "არყი",
        "საგუარო",
        "ნეკერჩხალი",
        "პალმა",
        "საკურა"
    };

    public List<string> TreeAgesData = new List<string>()
    {
        "253 წლის",
        "63 წლის",
        "2 წლის",
        "17 წლის",
        "7 წლის",
        "56 წლის"
    };
     
    public void ClearPlayerPrefs()
    {
        PlayerPrefs.DeleteAll();
    }
}
